{"weightsManifest": [{"weights": [{"dtype": "float32", "shape": [3, 3, 3, 32], "name": "conv2d_7/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_7/bias"}], "paths": ["group1-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 32, 32], "name": "conv2d_8/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_8/bias"}], "paths": ["group2-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 32, 64], "name": "conv2d_9/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_9/bias"}], "paths": ["group3-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [6400, 64], "name": "dense_5/kernel"}, {"dtype": "float32", "shape": [64], "name": "dense_5/bias"}], "paths": ["group4-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [64, 2], "name": "dense_6/kernel"}, {"dtype": "float32", "shape": [2], "name": "dense_6/bias"}], "paths": ["group5-shard1of1"]}], "modelTopology": {"backend": "tensorflow", "keras_version": "2.1.6", "model_config": {"config": [{"config": {"bias_constraint": null, "padding": "valid", "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 100, 100, 3], "use_bias": true, "dtype": "float32", "activation": "linear", "name": "conv2d_7", "filters": 32}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_7"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "padding": "valid", "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 100, 100, 3], "use_bias": true, "dtype": "float32", "activation": "linear", "name": "conv2d_8", "filters": 32}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_8"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "padding": "valid", "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 100, 100, 3], "use_bias": true, "dtype": "float32", "activation": "linear", "name": "conv2d_9", "filters": 64}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_9"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_3"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_5", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "units": 64}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "class_name": "Activation"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_6", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "units": 2}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_15"}, "class_name": "Activation"}], "class_name": "Sequential"}, "training_config": {"metrics": ["accuracy"], "sample_weight_mode": null, "optimizer_config": {"config": {"decay": 0.0, "beta_2": 0.9990000128746033, "amsgrad": false, "epsilon": 1e-07, "beta_1": 0.8999999761581421, "lr": 0.0010000000474974513}, "class_name": "Adam"}, "loss": "categorical_crossentropy", "loss_weights": null}}}